RhinoInside.Revit API Documentation
ColorWithTransparencyConverter.ToColor Method
 Converts the specified ColorWithTransparency to an equivalent Color.
 Namespace: RhinoInside.Revit.Convert.System.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8015
Syntax
public static Color ToColor(
	this ColorWithTransparency value
)
Parameters
value
Type: ColorWithTransparency
A value to convert.
Return Value
Type: Color
A Color that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type ColorWithTransparency. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
ColorWithTransparencyConverter Class
RhinoInside.Revit.Convert.System.Drawing Namespace